Tecnologic/u-boot-stm32/include/dt-bindings/pinctrl/stm32f769-pinfunc.h
#ifndef _DT_BINDINGS_STM32F769_PINFUNC_H
#define _DT_BINDINGS_STM32F769_PINFUNC_H

#define STM32F769_PA0_FUNC_GPIO 0x0
#define STM32F769_PA0_FUNC_TIM2_CH1_TIM2_ETR 0x2
#define STM32F769_PA0_FUNC_TIM5_CH1 0x3
#define STM32F769_PA0_FUNC_TIM8_ETR 0x4
#define STM32F769_PA0_FUNC_USART2_CTS 0x8
#define STM32F769_PA0_FUNC_UART4_TX 0x9
#define STM32F769_PA0_FUNC_SAI2_SD_B 0xb
#define STM32F769_PA0_FUNC_ETH_MII_CRS 0xc
#define STM32F769_PA0_FUNC_EVENTOUT 0x10
#define STM32F769_PA0_FUNC_ANALOG 0x11

#define STM32F769_PA1_FUNC_GPIO 0x100
#define STM32F769_PA1_FUNC_TIM2_CH2 0x102
#define STM32F769_PA1_FUNC_TIM5_CH2 0x103
#define STM32F769_PA1_FUNC_USART2_RTS 0x108
#define STM32F769_PA1_FUNC_UART4_RX 0x109
#define STM32F769_PA1_FUNC_QUADSPI_BK1_IO3 0x10a
#define STM32F769_PA1_FUNC_SAI2_MCLK_B 0x10b
#define STM32F769_PA1_FUNC_ETH_MII_RX_CLK_ETH_RMII_REF_CLK 0x10c
#define STM32F769_PA1_FUNC_LCD_R2 0x10f
#define STM32F769_PA1_FUNC_EVENTOUT 0x110
#define STM32F769_PA1_FUNC_ANALOG 0x111

#define STM32F769_PA2_FUNC_GPIO 0x200
#define STM32F769_PA2_FUNC_TIM2_CH3 0x202
#define STM32F769_PA2_FUNC_TIM5_CH3 0x203
#define STM32F769_PA2_FUNC_TIM9_CH1 0x204
#define STM32F769_PA2_FUNC_USART2_TX 0x208
#define STM32F769_PA2_FUNC_SAI2_SCK_B 0x209
#define STM32F769_PA2_FUNC_ETH_MDIO 0x20c
#define STM32F769_PA2_FUNC_MDIOS_MDIO 0x20d
#define STM32F769_PA2_FUNC_LCD_R1 0x20f
#define STM32F769_PA2_FUNC_EVENTOUT 0x210
#define STM32F769_PA2_FUNC_ANALOG 0x211

#define STM32F769_PA3_FUNC_GPIO 0x300
#define STM32F769_PA3_FUNC_TIM2_CH4 0x302
#define STM32F769_PA3_FUNC_TIM5_CH4 0x303
#define STM32F769_PA3_FUNC_TIM9_CH2 0x304
#define STM32F769_PA3_FUNC_USART2_RX 0x308
#define STM32F769_PA3_FUNC_LCD_B2 0x30a
#define STM32F769_PA3_FUNC_OTG_HS_ULPI_D0 0x30b
#define STM32F769_PA3_FUNC_ETH_MII_COL 0x30c
#define STM32F769_PA3_FUNC_LCD_B5 0x30f
#define STM32F769_PA3_FUNC_EVENTOUT 0x310
#define STM32F769_PA3_FUNC_ANALOG 0x311

#define STM32F769_PA4_FUNC_GPIO 0x400
#define STM32F769_PA4_FUNC_SPI1_NSS_I2S1_WS 0x406
#define STM32F769_PA4_FUNC_SPI3_NSS_I2S3_WS 0x407
#define STM32F769_PA4_FUNC_USART2_CK 0x408
#define STM32F769_PA4_FUNC_SPI6_NSS 0x409
#define STM32F769_PA4_FUNC_OTG_HS_SOF 0x40d
#define STM32F769_PA4_FUNC_DCMI_HSYNC 0x40e
#define STM32F769_PA4_FUNC_LCD_VSYNC 0x40f
#define STM32F769_PA4_FUNC_EVENTOUT 0x410
#define STM32F769_PA4_FUNC_ANALOG 0x411

#define STM32F769_PA5_FUNC_GPIO 0x500
#define STM32F769_PA5_FUNC_TIM2_CH1_TIM2_ETR 0x502
#define STM32F769_PA5_FUNC_TIM8_CH1N 0x504
#define STM32F769_PA5_FUNC_SPI1_SCK_I2S1_CK 0x506
#define STM32F769_PA5_FUNC_SPI6_SCK 0x509
#define STM32F769_PA5_FUNC_OTG_HS_ULPI_CK 0x50b
#define STM32F769_PA5_FUNC_LCD_R4 0x50f
#define STM32F769_PA5_FUNC_EVENTOUT 0x510
#define STM32F769_PA5_FUNC_ANALOG 0x511

#define STM32F769_PA6_FUNC_GPIO 0x600
#define STM32F769_PA6_FUNC_TIM1_BKIN 0x602
#define STM32F769_PA6_FUNC_TIM3_CH1 0x603
#define STM32F769_PA6_FUNC_TIM8_BKIN 0x604
#define STM32F769_PA6_FUNC_SPI1_MISO 0x606
#define STM32F769_PA6_FUNC_SPI6_MISO 0x609
#define STM32F769_PA6_FUNC_TIM13_CH1 0x60a
#define STM32F769_PA6_FUNC_MDIOS_MDC 0x60d
#define STM32F769_PA6_FUNC_DCMI_PIXCLK 0x60e
#define STM32F769_PA6_FUNC_LCD_G2 0x60f
#define STM32F769_PA6_FUNC_EVENTOUT 0x610
#define STM32F769_PA6_FUNC_ANALOG 0x611

#define STM32F769_PA7_FUNC_GPIO 0x700
#define STM32F769_PA7_FUNC_TIM1_CH1N 0x702
#define STM32F769_PA7_FUNC_TIM3_CH2 0x703
#define STM32F769_PA7_FUNC_TIM8_CH1N 0x704
#define STM32F769_PA7_FUNC_SPI1_MOSI_I2S1_SD 0x706
#define STM32F769_PA7_FUNC_SPI6_MOSI 0x709
#define STM32F769_PA7_FUNC_TIM14_CH1 0x70a
#define STM32F769_PA7_FUNC_ETH_MII_RX_DV_ETH_RMII_CRS_DV 0x70c
#define STM32F769_PA7_FUNC_FMC_SDNWE 0x70d
#define STM32F769_PA7_FUNC_EVENTOUT 0x710
#define STM32F769_PA7_FUNC_ANALOG 0x711

#define STM32F769_PA8_FUNC_GPIO 0x800
#define STM32F769_PA8_FUNC_MCO1 0x801
#define STM32F769_PA8_FUNC_TIM1_CH1 0x802
#define STM32F769_PA8_FUNC_TIM8_BKIN2 0x804
#define STM32F769_PA8_FUNC_I2C3_SCL 0x805
#define STM32F769_PA8_FUNC_USART1_CK 0x808
#define STM32F769_PA8_FUNC_OTG_FS_SOF 0x80b
#define STM32F769_PA8_FUNC_CAN3_RX 0x80c
#define STM32F769_PA8_FUNC_UART7_RX 0x80d
#define STM32F769_PA8_FUNC_LCD_B3 0x80e
#define STM32F769_PA8_FUNC_LCD_R6 0x80f
#define STM32F769_PA8_FUNC_EVENTOUT 0x810
#define STM32F769_PA8_FUNC_ANALOG 0x811

#define STM32F769_PA9_FUNC_GPIO 0x900
#define STM32F769_PA9_FUNC_TIM1_CH2 0x902
#define STM32F769_PA9_FUNC_I2C3_SMBA 0x905
#define STM32F769_PA9_FUNC_SPI2_SCK_I2S2_CK 0x906
#define STM32F769_PA9_FUNC_USART1_TX 0x908
#define STM32F769_PA9_FUNC_DCMI_D0 0x90e
#define STM32F769_PA9_FUNC_LCD_R5 0x90f
#define STM32F769_PA9_FUNC_EVENTOUT 0x910
#define STM32F769_PA9_FUNC_ANALOG 0x911

#define STM32F769_PA10_FUNC_GPIO 0xa00
#define STM32F769_PA10_FUNC_TIM1_CH3 0xa02
#define STM32F769_PA10_FUNC_USART1_RX 0xa08
#define STM32F769_PA10_FUNC_LCD_B4 0xa0a
#define STM32F769_PA10_FUNC_OTG_FS_ID 0xa0b
#define STM32F769_PA10_FUNC_MDIOS_MDIO 0xa0d
#define STM32F769_PA10_FUNC_DCMI_D1 0xa0e
#define STM32F769_PA10_FUNC_LCD_B1 0xa0f
#define STM32F769_PA10_FUNC_EVENTOUT 0xa10
#define STM32F769_PA10_FUNC_ANALOG 0xa11

#define STM32F769_PA11_FUNC_GPIO 0xb00
#define STM32F769_PA11_FUNC_TIM1_CH4 0xb02
#define STM32F769_PA11_FUNC_SPI2_NSS_I2S2_WS 0xb06
#define STM32F769_PA11_FUNC_UART4_RX 0xb07
#define STM32F769_PA11_FUNC_USART1_CTS 0xb08
#define STM32F769_PA11_FUNC_CAN1_RX 0xb0a
#define STM32F769_PA11_FUNC_OTG_FS_DM 0xb0b
#define STM32F769_PA11_FUNC_LCD_R4 0xb0f
#define STM32F769_PA11_FUNC_EVENTOUT 0xb10
#define STM32F769_PA11_FUNC_ANALOG 0xb11

#define STM32F769_PA12_FUNC_GPIO 0xc00
#define STM32F769_PA12_FUNC_TIM1_ETR 0xc02
#define STM32F769_PA12_FUNC_SPI2_SCK_I2S2_CK 0xc06
#define STM32F769_PA12_FUNC_UART4_TX 0xc07
#define STM32F769_PA12_FUNC_USART1_RTS 0xc08
#define STM32F769_PA12_FUNC_SAI2_FS_B 0xc09
#define STM32F769_PA12_FUNC_CAN1_TX 0xc0a
#define STM32F769_PA12_FUNC_OTG_FS_DP 0xc0b
#define STM32F769_PA12_FUNC_LCD_R5 0xc0f
#define STM32F769_PA12_FUNC_EVENTOUT 0xc10
#define STM32F769_PA12_FUNC_ANALOG 0xc11

#define STM32F769_PA13_FUNC_GPIO 0xd00
#define STM32F769_PA13_FUNC_JTMS_SWDIO 0xd01
#define STM32F769_PA13_FUNC_EVENTOUT 0xd10
#define STM32F769_PA13_FUNC_ANALOG 0xd11

#define STM32F769_PA14_FUNC_GPIO 0xe00
#define STM32F769_PA14_FUNC_JTCK_SWCLK 0xe01
#define STM32F769_PA14_FUNC_EVENTOUT 0xe10
#define STM32F769_PA14_FUNC_ANALOG 0xe11

#define STM32F769_PA15_FUNC_GPIO 0xf00
#define STM32F769_PA15_FUNC_JTDI 0xf01
#define STM32F769_PA15_FUNC_TIM2_CH1_TIM2_ETR 0xf02
#define STM32F769_PA15_FUNC_HDMI_CEC 0xf05
#define STM32F769_PA15_FUNC_SPI1_NSS_I2S1_WS 0xf06
#define STM32F769_PA15_FUNC_SPI3_NSS_I2S3_WS 0xf07
#define STM32F769_PA15_FUNC_UART4_RTS 0xf09
#define STM32F769_PA15_FUNC_CAN3_TX 0xf0c
#define STM32F769_PA15_FUNC_UART7_TX 0xf0d
#define STM32F769_PA15_FUNC_EVENTOUT 0xf10
#define STM32F769_PA15_FUNC_ANALOG 0xf11


#define STM32F769_PB0_FUNC_GPIO 0x1000
#define STM32F769_PB0_FUNC_TIM1_CH2N 0x1002
#define STM32F769_PB0_FUNC_TIM3_CH3 0x1003
#define STM32F769_PB0_FUNC_TIM8_CH2N 0x1004
#define STM32F769_PB0_FUNC_DFSDM1_CKOUT 0x1007
#define STM32F769_PB0_FUNC_UART4_CTS 0x1009
#define STM32F769_PB0_FUNC_LCD_R3 0x100a
#define STM32F769_PB0_FUNC_OTG_HS_ULPI_D1 0x100b
#define STM32F769_PB0_FUNC_ETH_MII_RXD2 0x100c
#define STM32F769_PB0_FUNC_LCD_G1 0x100f
#define STM32F769_PB0_FUNC_EVENTOUT 0x1010
#define STM32F769_PB0_FUNC_ANALOG 0x1011

