Tecnologic/u-boot-stm32/include/dt-bindings/pinctrl/stm32f769-pinfunc.h
#define STM32F769_PB1_FUNC_GPIO 0x1100
#define STM32F769_PB1_FUNC_TIM1_CH3N 0x1102
#define STM32F769_PB1_FUNC_TIM3_CH4 0x1103
#define STM32F769_PB1_FUNC_TIM8_CH3N 0x1104
#define STM32F769_PB1_FUNC_DFSDM_DATIN1 0x1107
#define STM32F769_PB1_FUNC_LCD_R6 0x110a
#define STM32F769_PB1_FUNC_OTG_HS_ULPI_D2 0x110b
#define STM32F769_PB1_FUNC_ETH_MII_RXD3 0x110c
#define STM32F769_PB1_FUNC_LCD_G0 0x110f
#define STM32F769_PB1_FUNC_EVENTOUT 0x1110
#define STM32F769_PB1_FUNC_ANALOG 0x1111

#define STM32F769_PB2_FUNC_GPIO 0x1200
#define STM32F769_PB2_FUNC_SAI1_SD_A 0x1207
#define STM32F769_PB2_FUNC_SPI3_MOSI_I2S3_SD 0x1208
#define STM32F769_PB2_FUNC_QUADSPI_CLK 0x120a
#define STM32F769_PB2_FUNC_DFSDM1_CKIN1 0x120b
#define STM32F769_PB2_FUNC_EVENTOUT 0x1210
#define STM32F769_PB2_FUNC_ANALOG 0x1211

#define STM32F769_PB3_FUNC_GPIO 0x1300
#define STM32F769_PB3_FUNC_JTDO_TRACESWO 0x1301
#define STM32F769_PB3_FUNC_TIM2_CH2 0x1302
#define STM32F769_PB3_FUNC_SPI1_SCK_I2S1_CK 0x1306
#define STM32F769_PB3_FUNC_SPI3_SCK_I2S3_CK 0x1307
#define STM32F769_PB3_FUNC_SPI6_SCK 0x1309
#define STM32F769_PB3_FUNC_SDMMC2_D2 0x130b
#define STM32F769_PB3_FUNC_CAN3_RX 0x130c
#define STM32F769_PB3_FUNC_UART7_RX 0x130d
#define STM32F769_PB3_FUNC_EVENTOUT 0x1310
#define STM32F769_PB3_FUNC_ANALOG 0x1311

#define STM32F769_PB4_FUNC_GPIO 0x1400
#define STM32F769_PB4_FUNC_NJTRST 0x1401
#define STM32F769_PB4_FUNC_TIM3_CH1 0x1403
#define STM32F769_PB4_FUNC_SPI1_MISO 0x1406
#define STM32F769_PB4_FUNC_SPI3_MISO 0x1407
#define STM32F769_PB4_FUNC_SPI2_NSS_I2S2_WS 0x1408
#define STM32F769_PB4_FUNC_SPI6_MISO 0x1409
#define STM32F769_PB4_FUNC_SDMMC2_D3 0x140b
#define STM32F769_PB4_FUNC_CAN3_TX 0x140c
#define STM32F769_PB4_FUNC_UART7_TX 0x140d
#define STM32F769_PB4_FUNC_EVENTOUT 0x1410
#define STM32F769_PB4_FUNC_ANALOG 0x1411

#define STM32F769_PB5_FUNC_GPIO 0x1500
#define STM32F769_PB5_FUNC_UART5_RX 0x1502
#define STM32F769_PB5_FUNC_TIM3_CH2 0x1503
#define STM32F769_PB5_FUNC_I2C1_SMBA 0x1505
#define STM32F769_PB5_FUNC_SPI1_MOSI_I2S1_SD 0x1506
#define STM32F769_PB5_FUNC_SPI3_MOSI_I2S3_SD 0x1507
#define STM32F769_PB5_FUNC_SPI6_MOSI 0x15079
#define STM32F769_PB5_FUNC_CAN2_RX 0x150a
#define STM32F769_PB5_FUNC_OTG_HS_ULPI_D7 0x150b
#define STM32F769_PB5_FUNC_ETH_PPS_OUT 0x150c
#define STM32F769_PB5_FUNC_FMC_SDCKE1 0x150d
#define STM32F769_PB5_FUNC_DCMI_D10 0x150e
#define STM32F769_PB5_FUNC_LCD_G7 0x150f
#define STM32F769_PB5_FUNC_EVENTOUT 0x1510
#define STM32F769_PB5_FUNC_ANALOG 0x1511

#define STM32F769_PB6_FUNC_GPIO 0x1600
#define STM32F769_PB6_FUNC_UART5_TX 0x1602
#define STM32F769_PB6_FUNC_TIM4_CH1 0x1603
#define STM32F769_PB6_FUNC_HDMI_CEC 0x1604
#define STM32F769_PB6_FUNC_I2C1_SCL 0x1605
#define STM32F769_PB6_FUNC_DFSDM_DATIN5 0x1607
#define STM32F769_PB6_FUNC_USART1_TX 0x1608
#define STM32F769_PB6_FUNC_CAN2_TX 0x160a
#define STM32F769_PB6_FUNC_QUADSPI_BK1_NCS 0x160b
#define STM32F769_PB6_FUNC_I2C4_SCL 0x160c
#define STM32F769_PB6_FUNC_FMC_SDNE1 0x160d
#define STM32F769_PB6_FUNC_DCMI_D5 0x160e
#define STM32F769_PB6_FUNC_EVENTOUT 0x1610
#define STM32F769_PB6_FUNC_ANALOG 0x1611

#define STM32F769_PB7_FUNC_GPIO 0x1700
#define STM32F769_PB7_FUNC_TIM4_CH2 0x1703
#define STM32F769_PB7_FUNC_I2C1_SDA 0x1705
#define STM32F769_PB7_FUNC_DFSDM_CKIN5 0x1707
#define STM32F769_PB7_FUNC_USART1_RX 0x1708
#define STM32F769_PB7_FUNC_I2C4_SDA 0x170c		// Datasheet error sould be i2c not i2s
#define STM32F769_PB7_FUNC_FMC_NL 0x170d
#define STM32F769_PB7_FUNC_DCMI_VSYNC 0x170e
#define STM32F769_PB7_FUNC_EVENTOUT 0x1710
#define STM32F769_PB7_FUNC_ANALOG 0x1711

#define STM32F769_PB8_FUNC_GPIO 0x1800
#define STM32F769_PB8_FUNC_I2C4_SCL 0x1802
#define STM32F769_PB8_FUNC_TIM4_CH3 0x1803
#define STM32F769_PB8_FUNC_TIM10_CH1 0x1804
#define STM32F769_PB8_FUNC_I2C1_SCL 0x1805
#define STM32F769_PB8_FUNC_DFSDM1_CKIN7 0x1807
#define STM32F769_PB8_FUNC_UART5_RX 0x1808
#define STM32F769_PB8_FUNC_CAN1_RX 0x180a
#define STM32F769_PB8_FUNC_ETH_MII_TXD3 0x180c
#define STM32F769_PB8_FUNC_SDMMC1_D4 0x180d
#define STM32F769_PB8_FUNC_DCMI_D6 0x180e
#define STM32F769_PB8_FUNC_LCD_B6 0x180f
#define STM32F769_PB8_FUNC_EVENTOUT 0x1810
#define STM32F769_PB8_FUNC_ANALOG 0x1811

#define STM32F769_PB9_FUNC_GPIO 0x1900
#define STM32F769_PB9_FUNC_I2C4_SDA 0x1902				// Datasheet typo
#define STM32F769_PB9_FUNC_TIM4_CH4 0x1903
#define STM32F769_PB9_FUNC_TIM11_CH1 0x1904
#define STM32F769_PB9_FUNC_I2C1_SDA 0x1905
#define STM32F769_PB9_FUNC_SPI2_NSS_I2S2_WS 0x1906
#define STM32F769_PB9_FUNC_DFSDM1_DATIN7 0x1907
#define STM32F769_PB9_FUNC_UART5_TX 0x1908
#define STM32F769_PB9_FUNC_CAN1_TX 0x190a
#define STM32F769_PB9_FUNC_I2C4_SMBA 0x190c
#define STM32F769_PB9_FUNC_SDMMC1_D5 0x190d
#define STM32F769_PB9_FUNC_DCMI_D7 0x190e
#define STM32F769_PB9_FUNC_LCD_B7 0x190f
#define STM32F769_PB9_FUNC_EVENTOUT 0x1910
#define STM32F769_PB9_FUNC_ANALOG 0x1911

#define STM32F769_PB10_FUNC_GPIO 0x1a00
#define STM32F769_PB10_FUNC_TIM2_CH3 0x1a02
#define STM32F769_PB10_FUNC_I2C2_SCL 0x1a05
#define STM32F769_PB10_FUNC_SPI2_SCK_I2S2_CK 0x1a06
#define STM32F769_PB10_FUNC_DFSDM1_DATIN7 0x1a07
#define STM32F769_PB10_FUNC_USART3_TX 0x1a08
#define STM32F769_PB10_FUNC_QUADSPI_BK1_NCS 0x1a0a
#define STM32F769_PB10_FUNC_OTG_HS_ULPI_D3 0x1a0b
#define STM32F769_PB10_FUNC_ETH_MII_RX_ER 0x1a0c
#define STM32F769_PB10_FUNC_LCD_G4 0x1a0f
#define STM32F769_PB10_FUNC_EVENTOUT 0x1a10
#define STM32F769_PB10_FUNC_ANALOG 0x1a11

#define STM32F769_PB11_FUNC_GPIO 0x1b00
#define STM32F769_PB11_FUNC_TIM2_CH4 0x1b02
#define STM32F769_PB11_FUNC_I2C2_SDA 0x1b05
#define STM32F769_PB11_FUNC_DFSDM1_CKIN7 0x1b07
#define STM32F769_PB11_FUNC_USART3_RX 0x1b08
#define STM32F769_PB11_FUNC_OTG_HS_ULPI_D4 0x1b0b
#define STM32F769_PB11_FUNC_ETH_MII_TX_EN_ETH_RMII_TX_EN 0x1b0c
#define STM32F769_PB11_FUNC_DSI_TE 0x1b0e
#define STM32F769_PB11_FUNC_LCD_G5 0x1b0f
#define STM32F769_PB11_FUNC_EVENTOUT 0x1b10
#define STM32F769_PB11_FUNC_ANALOG 0x1b11

#define STM32F769_PB12_FUNC_GPIO 0x1c00
#define STM32F769_PB12_FUNC_TIM1_BKIN 0x1c02
#define STM32F769_PB12_FUNC_I2C2_SMBA 0x1c05
#define STM32F769_PB12_FUNC_SPI2_NSS_I2S2_WS 0x1c06
#define STM32F769_PB12_FUNC_DFSDM1_DATIN1 0x1c07
#define STM32F769_PB12_FUNC_USART3_CK 0x1c08
#define STM32F769_PB12_FUNC_UART5_TX 0x1c09
#define STM32F769_PB12_FUNC_CAN2_RX 0x1c0a
#define STM32F769_PB12_FUNC_OTG_HS_ULPI_D5 0x1c0b
#define STM32F769_PB12_FUNC_ETH_MII_TXD0_ETH_RMII_TXD0 0x1c0c
#define STM32F769_PB12_FUNC_OTG_HS_ID 0x1c0d
#define STM32F769_PB12_FUNC_EVENTOUT 0x1c10
#define STM32F769_PB12_FUNC_ANALOG 0x1c11

