Tecnologic/u-boot-stm32/include/dt-bindings/pinctrl/stm32f769-pinfunc.h
#define STM32F769_PB13_FUNC_GPIO 0x1d00
#define STM32F769_PB13_FUNC_TIM1_CH1N 0x1d02
#define STM32F769_PB13_FUNC_SPI2_SCK_I2S2_CK 0x1d06
#define STM32F769_PB13_FUNC_DFSDM1_CKIN1 0x1d07
#define STM32F769_PB13_FUNC_USART3_CTS 0x1d08
#define STM32F769_PB13_FUNC_UART5_TX 0x1d09
#define STM32F769_PB13_FUNC_CAN2_TX 0x1d0a
#define STM32F769_PB13_FUNC_OTG_HS_ULPI_D6 0x1d0b
#define STM32F769_PB13_FUNC_ETH_MII_TXD1_ETH_RMII_TXD1 0x1d0c
#define STM32F769_PB13_FUNC_EVENTOUT 0x1d10
#define STM32F769_PB13_FUNC_ANALOG 0x1d11

#define STM32F769_PB14_FUNC_GPIO 0x1e00
#define STM32F769_PB14_FUNC_TIM1_CH2N 0x1e02
#define STM32F769_PB14_FUNC_TIM8_CH2N 0x1e04
#define STM32F769_PB14_FUNC_USART1_TX 0x1e05
#define STM32F769_PB14_FUNC_SPI2_MISO 0x1e06
#define STM32F769_PB14_FUNC_DFSDM1_DATIN2 0x1e07
#define STM32F769_PB14_FUNC_USART3_RTS 0x1e08
#define STM32F769_PB14_FUNC_UART4_RTS 0x1e09
#define STM32F769_PB14_FUNC_TIM12_CH1 0x1e0a
#define STM32F769_PB14_FUNC_SDMMC2_D0 0x1e0b
#define STM32F769_PB14_FUNC_OTG_HS_DM 0x1e0d
#define STM32F769_PB14_FUNC_EVENTOUT 0x1e10
#define STM32F769_PB14_FUNC_ANALOG 0x1e11

#define STM32F769_PB15_FUNC_GPIO 0x1f00
#define STM32F769_PB15_FUNC_RTC_REFIN 0x1f01
#define STM32F769_PB15_FUNC_TIM1_CH3N 0x1f02
#define STM32F769_PB15_FUNC_TIM8_CH3N 0x1f04
#define STM32F769_PB15_FUNC_USART1_RX 0x1f05
#define STM32F769_PB15_FUNC_SPI2_MOSI_I2S2_SD 0x1f06
#define STM32F769_PB15_FUNC_DFSDM1_CKIN2 0x1f07
#define STM32F769_PB15_FUNC_UART4_CTS 0x1f09
#define STM32F769_PB15_FUNC_TIM12_CH2 0x1f0a
#define STM32F769_PB15_FUNC_OTG_HS_DP 0x1f0d
#define STM32F769_PB15_FUNC_EVENTOUT 0x1f10
#define STM32F769_PB15_FUNC_ANALOG 0x1f11


#define STM32F769_PC0_FUNC_GPIO 0x2000
#define STM32F769_PC0_FUNC_DFSDM1_CKIN0 0x2004
#define STM32F769_PC0_FUNC_DFSDM1_DATIN4 0x2007
#define STM32F769_PC0_FUNC_SAI2_FS_B 0x2009
#define STM32F769_PC0_FUNC_OTG_HS_ULPI_STP 0x200b
#define STM32F769_PC0_FUNC_FMC_SDNWE 0x200d
#define STM32F769_PC0_FUNC_LCD_R5 0x200f
#define STM32F769_PC0_FUNC_EVENTOUT 0x2010
#define STM32F769_PC0_FUNC_ANALOG 0x2011

#define STM32F769_PC1_FUNC_GPIO 0x2100
#define STM32F769_PC1_FUNC_TRACED0 0x2101
#define STM32F769_PC1_FUNC_DFSDM1_DATIN0 0x2104
#define STM32F769_PC1_FUNC_SPI2_MOSI_I2S2_SD 0x2106
#define STM32F769_PC1_FUNC_SAI1_SD_A 0x2107
#define STM32F769_PC1_FUNC_DFSDM1_CKIN0 0x210b
#define STM32F769_PC1_FUNC_ETH_MDC 0x210c
#define STM32F769_PC1_FUNC_MDIOS_MDC 0x210d
#define STM32F769_PC1_FUNC_EVENTOUT 0x2110
#define STM32F769_PC1_FUNC_ANALOG 0x2111

#define STM32F769_PC2_FUNC_GPIO 0x2200
#define STM32F769_PC2_FUNC_DFSDM1_CKIN1 0x2204
#define STM32F769_PC2_FUNC_SPI2_MISO 0x2206
#define STM32F769_PC2_FUNC_OTG_HS_ULPI_DIR 0x220b
#define STM32F769_PC2_FUNC_ETH_MII_TXD2 0x220c
#define STM32F769_PC2_FUNC_FMC_SDNE0 0x220d
#define STM32F769_PC2_FUNC_EVENTOUT 0x2210
#define STM32F769_PC2_FUNC_ANALOG 0x2211

#define STM32F769_PC3_FUNC_GPIO 0x2300
#define STM32F769_PC3_FUNC_DFSDM1_DATIN1 0x2304
#define STM32F769_PC3_FUNC_SPI2_MOSI_I2S2_SD 0x2306
#define STM32F769_PC3_FUNC_OTG_HS_ULPI_NXT 0x230b
#define STM32F769_PC3_FUNC_ETH_MII_TX_CLK 0x230c
#define STM32F769_PC3_FUNC_FMC_SDCKE0 0x230d
#define STM32F769_PC3_FUNC_EVENTOUT 0x2310
#define STM32F769_PC3_FUNC_ANALOG 0x2311

#define STM32F769_PC4_FUNC_GPIO 0x2400
#define STM32F769_PC4_FUNC_DFSDM1_SKIN2 0x2404
#define STM32F769_PC4_FUNC_I2S1_MCK 0x2406
#define STM32F769_PC4_FUNC_SPDIFRX_IN2 0x2409
#define STM32F769_PC4_FUNC_ETH_MII_RXD0_ETH_RMII_RXD0 0x240c
#define STM32F769_PC4_FUNC_FMC_SDNE0 0x240d
#define STM32F769_PC4_FUNC_EVENTOUT 0x2410
#define STM32F769_PC4_FUNC_ANALOG 0x2411

#define STM32F769_PC5_FUNC_GPIO 0x2500
#define STM32F769_PC5_FUNC_DFSDM1_DATIN2 0x2504
#define STM32F769_PC5_FUNC_SPDIFRX_IN3 0x2509
#define STM32F769_PC5_FUNC_ETH_MII_RXD1_ETH_RMII_RXD1 0x250c
#define STM32F769_PC5_FUNC_FMC_SDCKE0 0x250d
#define STM32F769_PC5_FUNC_EVENTOUT 0x2510
#define STM32F769_PC5_FUNC_ANALOG 0x2511

#define STM32F769_PC6_FUNC_GPIO 0x2600
#define STM32F769_PC6_FUNC_TIM3_CH1 0x2603
#define STM32F769_PC6_FUNC_TIM8_CH1 0x2604
#define STM32F769_PC6_FUNC_I2S2_MCK 0x2606
#define STM32F769_PC6_FUNC_DFSDM1_CKIN3 0x2608
#define STM32F769_PC6_FUNC_USART6_TX 0x2609
#define STM32F769_PC6_FUNC_FMC_NWAIT 0x260a
#define STM32F769_PC6_FUNC_SDMMC1_D6 0x260d
#define STM32F769_PC6_FUNC_DCMI_D0 0x260e
#define STM32F769_PC6_FUNC_LCD_HSYNC 0x260f
#define STM32F769_PC6_FUNC_EVENTOUT 0x2610
#define STM32F769_PC6_FUNC_ANALOG 0x2611

#define STM32F769_PC7_FUNC_GPIO 0x2700
#define STM32F769_PC7_FUNC_TIM3_CH2 0x2703
#define STM32F769_PC7_FUNC_TIM8_CH2 0x2704
#define STM32F769_PC7_FUNC_I2S3_MCK 0x2707
#define STM32F769_PC7_FUNC_DFSDM1_DATIN3 0x2708
#define STM32F769_PC7_FUNC_USART6_RX 0x2709
#define STM32F769_PC7_FUNC_FMC_NE1 0x270a
#define STM32F769_PC7_FUNC_SDMMC1_D7 0x270d
#define STM32F769_PC7_FUNC_DCMI_D1 0x270e
#define STM32F769_PC7_FUNC_LCD_G6 0x270f
#define STM32F769_PC7_FUNC_EVENTOUT 0x2710
#define STM32F769_PC7_FUNC_ANALOG 0x2711

#define STM32F769_PC8_FUNC_GPIO 0x2800
#define STM32F769_PC8_FUNC_TRACED1 0x2801
#define STM32F769_PC8_FUNC_TIM3_CH3 0x2803
#define STM32F769_PC8_FUNC_TIM8_CH3 0x2804
#define STM32F769_PC8_FUNC_UART5_RTS 0x2808
#define STM32F769_PC8_FUNC_USART6_CK 0x2809
#define STM32F769_PC8_FUNC_FMC_NE2_FMC_NCE 0x280a
#define STM32F769_PC8_FUNC_SDMMC1_D0 0x280d
#define STM32F769_PC8_FUNC_DCMI_D2 0x280e
#define STM32F769_PC8_FUNC_EVENTOUT 0x2810
#define STM32F769_PC8_FUNC_ANALOG 0x2811

#define STM32F769_PC9_FUNC_GPIO 0x2900
#define STM32F769_PC9_FUNC_MCO2 0x2901
#define STM32F769_PC9_FUNC_TIM3_CH4 0x2903
#define STM32F769_PC9_FUNC_TIM8_CH4 0x2904
#define STM32F769_PC9_FUNC_I2C3_SDA 0x2905
#define STM32F769_PC9_FUNC_I2S_CKIN 0x2906
#define STM32F769_PC9_FUNC_UART5_CTS 0x2908
#define STM32F769_PC9_FUNC_QUADSPI_BK1_IO0 0x290a
#define STM32F769_PC9_FUNC_LCD_G3 0x290b
#define STM32F769_PC9_FUNC_SDMMC1_D1 0x290d
#define STM32F769_PC9_FUNC_DCMI_D3 0x290e
#define STM32F769_PC9_FUNC_EVENTOUT 0x2910
#define STM32F769_PC9_FUNC_ANALOG 0x2911

#define STM32F769_PC10_FUNC_GPIO 0x2a00
#define STM32F769_PC10_FUNC_DFSDM1_CKIN5 0x2a04
#define STM32F769_PC10_FUNC_SPI3_SCK_I2S3_CK 0x2a07
#define STM32F769_PC10_FUNC_USART3_TX 0x2a08
#define STM32F769_PC10_FUNC_UART4_TX 0x2a09
#define STM32F769_PC10_FUNC_QUADSPI_BK1_IO1 0x2a0a
#define STM32F769_PC10_FUNC_SDMMC1_D2 0x2a0d
#define STM32F769_PC10_FUNC_DCMI_D8 0x2a0e
#define STM32F769_PC10_FUNC_LCD_R2 0x2a0f
#define STM32F769_PC10_FUNC_EVENTOUT 0x2a10
#define STM32F769_PC10_FUNC_ANALOG 0x2a11

#define STM32F769_PC11_FUNC_GPIO 0x2b00
#define STM32F769_PC11_FUNC_DFSDM1_DATIN5 0x2b04
#define STM32F769_PC11_FUNC_SPI3_MISO 0x2b07
#define STM32F769_PC11_FUNC_USART3_RX 0x2b08
#define STM32F769_PC11_FUNC_UART4_RX 0x2b09
#define STM32F769_PC11_FUNC_QUADSPI_BK2_NCS 0x2b0a
#define STM32F769_PC11_FUNC_SDMMC1_D3 0x2b0d
#define STM32F769_PC11_FUNC_DCMI_D4 0x2b0e
#define STM32F769_PC11_FUNC_EVENTOUT 0x2b10
#define STM32F769_PC11_FUNC_ANALOG 0x2b11

