Tecnologic/u-boot-stm32/include/dt-bindings/pinctrl/stm32f769-pinfunc.h
#define STM32F769_PG2_FUNC_GPIO 0x6200
#define STM32F769_PG2_FUNC_FMC_A12 0x620d
#define STM32F769_PG2_FUNC_EVENTOUT 0x6210
#define STM32F769_PG2_FUNC_ANALOG 0x6211

#define STM32F769_PG3_FUNC_GPIO 0x6300
#define STM32F769_PG3_FUNC_FMC_A13 0x630d
#define STM32F769_PG3_FUNC_EVENTOUT 0x6310
#define STM32F769_PG3_FUNC_ANALOG 0x6311

#define STM32F769_PG4_FUNC_GPIO 0x6400
#define STM32F769_PG4_FUNC_FMC_A14_FMC_BA0 0x640d
#define STM32F769_PG4_FUNC_EVENTOUT 0x6410
#define STM32F769_PG4_FUNC_ANALOG 0x6411

#define STM32F769_PG5_FUNC_GPIO 0x6500
#define STM32F769_PG5_FUNC_FMC_A15_FMC_BA1 0x650d
#define STM32F769_PG5_FUNC_EVENTOUT 0x6510
#define STM32F769_PG5_FUNC_ANALOG 0x6511

#define STM32F769_PG6_FUNC_GPIO 0x6600
#define STM32F769_PG6_FUNC_FMC_NE3 0x660d
#define STM32F769_PG6_FUNC_DCMI_D12 0x660e
#define STM32F769_PG6_FUNC_LCD_R7 0x660f
#define STM32F769_PG6_FUNC_EVENTOUT 0x6610
#define STM32F769_PG6_FUNC_ANALOG 0x6611

#define STM32F769_PG7_FUNC_GPIO 0x6700
#define STM32F769_PG7_FUNC_SAI1_MCLK_A 0x6707
#define STM32F769_PG7_FUNC_USART6_CK 0x6709
#define STM32F769_PG7_FUNC_FMC_INT 0x670d
#define STM32F769_PG7_FUNC_DCMI_D13 0x670e
#define STM32F769_PG7_FUNC_LCD_CLK 0x670f
#define STM32F769_PG7_FUNC_EVENTOUT 0x6710
#define STM32F769_PG7_FUNC_ANALOG 0x6711

#define STM32F769_PG8_FUNC_GPIO 0x6800
#define STM32F769_PG8_FUNC_SPI6_NSS 0x6806
#define STM32F769_PG8_FUNC_SPDIFRX_IN2 0x6808
#define STM32F769_PG8_FUNC_USART6_RTS 0x6809
#define STM32F769_PG8_FUNC_ETH_PPS_OUT 0x680c
#define STM32F769_PG8_FUNC_FMC_SDCLK 0x680d
#define STM32F769_PG8_FUNC_LCD_G7 0x680f
#define STM32F769_PG8_FUNC_EVENTOUT 0x6810
#define STM32F769_PG8_FUNC_ANALOG 0x6811

#define STM32F769_PG9_FUNC_GPIO 0x6900
#define STM32F769_PG9_FUNC_SPI6_MISO 0x6906
#define STM32F769_PG9_FUNC_SPDIFRX_IN3 0x6908
#define STM32F769_PG9_FUNC_USART6_RX 0x6909
#define STM32F769_PG9_FUNC_QUADSPI_BK2_IO2 0x690a
#define STM32F769_PG9_FUNC_SAI2_FS_B 0x690b
#define STM32F769_PG9_FUNC_SDMMC2_D0 0x690c
#define STM32F769_PG9_FUNC_FMC_NE2_FMC_NCE 0x690d
#define STM32F769_PG9_FUNC_DCMI_VSYNC 0x690e
#define STM32F769_PG9_FUNC_EVENTOUT 0x6910
#define STM32F769_PG9_FUNC_ANALOG 0x6911

#define STM32F769_PG10_FUNC_GPIO 0x6a00
#define STM32F769_PG10_FUNC_SPI1_NSS_I2S1_WS 0x6a06
#define STM32F769_PG10_FUNC_LCD_G3 0x6a0a
#define STM32F769_PG10_FUNC_SAI2_SD_B 0x6a0b
#define STM32F769_PG10_FUNC_SDMMC2_D1 0x6a0c
#define STM32F769_PG10_FUNC_FMC_NE3 0x6a0d
#define STM32F769_PG10_FUNC_DCMI_D2 0x6a0e
#define STM32F769_PG10_FUNC_LCD_B2 0x6a0f
#define STM32F769_PG10_FUNC_EVENTOUT 0x6a10
#define STM32F769_PG10_FUNC_ANALOG 0x6a11

#define STM32F769_PG11_FUNC_GPIO 0x6b00
#define STM32F769_PG11_FUNC_SPI1_SCK_I2S1_CK 0x6b06
#define STM32F769_PG11_FUNC_SPDIFRX_IN0 0x6b08
#define STM32F769_PG11_FUNC_SDMMC2_D2 0x6b0b
#define STM32F769_PG11_FUNC_ETH_MII_TX_EN_ETH_RMII_TX_EN 0x6b0c
#define STM32F769_PG11_FUNC_DCMI_D3 0x6b0e
#define STM32F769_PG11_FUNC_LCD_B3 0x6b0f
#define STM32F769_PG11_FUNC_EVENTOUT 0x6b10
#define STM32F769_PG11_FUNC_ANALOG 0x6b11

#define STM32F769_PG12_FUNC_GPIO 0x6c00
#define STM32F769_PG12_FUNC_LPTIM1_IN1 0x6c04
#define STM32F769_PG12_FUNC_SPI6_MISO 0x6c06
#define STM32F769_PG12_FUNC_SPDIFRX_IN1 0x6c08
#define STM32F769_PG12_FUNC_USART6_RTS 0x6c09
#define STM32F769_PG12_FUNC_LCD_B4 0x6c0a
#define STM32F769_PG12_FUNC_SDMMC2_D3 0x6c0c
#define STM32F769_PG12_FUNC_FMC_NE4 0x6c0d
#define STM32F769_PG12_FUNC_LCD_B1 0x6c0f
#define STM32F769_PG12_FUNC_EVENTOUT 0x6c10
#define STM32F769_PG12_FUNC_ANALOG 0x6c11

#define STM32F769_PG13_FUNC_GPIO 0x6d00
#define STM32F769_PG13_FUNC_TRACED0 0x6d01
#define STM32F769_PG13_FUNC_LPTIM1_OUT 0x6d04
#define STM32F769_PG13_FUNC_SPI6_SCK 0x6d06
#define STM32F769_PG13_FUNC_USART6_CTS 0x6d09
#define STM32F769_PG13_FUNC_ETH_MII_TXD0_ETH_RMII_TXD0 0x6d0c
#define STM32F769_PG13_FUNC_FMC_A24 0x6d0d
#define STM32F769_PG13_FUNC_LCD_R0 0x6d0f
#define STM32F769_PG13_FUNC_EVENTOUT 0x6d10
#define STM32F769_PG13_FUNC_ANALOG 0x6d11

#define STM32F769_PG14_FUNC_GPIO 0x6e00
#define STM32F769_PG14_FUNC_TRACED1 0x6e01
#define STM32F769_PG14_FUNC_LPTIM1_ETR 0x6e04
#define STM32F769_PG14_FUNC_SPI6_MOSI 0x6e06
#define STM32F769_PG14_FUNC_USART6_TX 0x6e09
#define STM32F769_PG14_FUNC_QUADSPI_BK2_IO3 0x6e0a
#define STM32F769_PG14_FUNC_ETH_MII_TXD1_ETH_RMII_TXD1 0x6e0c
#define STM32F769_PG14_FUNC_FMC_A25 0x6e0d
#define STM32F769_PG14_FUNC_LCD_B0 0x6e0f
#define STM32F769_PG14_FUNC_EVENTOUT 0x6e10
#define STM32F769_PG14_FUNC_ANALOG 0x6e11

#define STM32F769_PG15_FUNC_GPIO 0x6f00
#define STM32F769_PG15_FUNC_USART6_CTS 0x6f09
#define STM32F769_PG15_FUNC_FMC_SDNCAS 0x6f0d
#define STM32F769_PG15_FUNC_DCMI_D13 0x6f0e
#define STM32F769_PG15_FUNC_EVENTOUT 0x6f10
#define STM32F769_PG15_FUNC_ANALOG 0x6f11


#define STM32F769_PH0_FUNC_GPIO 0x7000
#define STM32F769_PH0_FUNC_EVENTOUT 0x7010
#define STM32F769_PH0_FUNC_ANALOG 0x7011

#define STM32F769_PH1_FUNC_GPIO 0x7100
#define STM32F769_PH1_FUNC_EVENTOUT 0x7110
#define STM32F769_PH1_FUNC_ANALOG 0x7111

#define STM32F769_PH2_FUNC_GPIO 0x7200
#define STM32F769_PH2_FUNC_LPTIM1_IN2 0x7204
#define STM32F769_PH2_FUNC_QUADSPI_BK2_IO0 0x720a
#define STM32F769_PH2_FUNC_SAI2_SCK_B 0x720b
#define STM32F769_PH2_FUNC_ETH_MII_CRS 0x720c
#define STM32F769_PH2_FUNC_FMC_SDCKE0 0x720d
#define STM32F769_PH2_FUNC_LCD_R0 0x720f
#define STM32F769_PH2_FUNC_EVENTOUT 0x7210
#define STM32F769_PH2_FUNC_ANALOG 0x7211

#define STM32F769_PH3_FUNC_GPIO 0x7300
#define STM32F769_PH3_FUNC_QUADSPI_BK2_IO1 0x730a
#define STM32F769_PH3_FUNC_SAI2_MCLK_B 0x730b
#define STM32F769_PH3_FUNC_ETH_MII_COL 0x730c
#define STM32F769_PH3_FUNC_FMC_SDNE0 0x730d
#define STM32F769_PH3_FUNC_LCD_R1 0x730f
#define STM32F769_PH3_FUNC_EVENTOUT 0x7310
#define STM32F769_PH3_FUNC_ANALOG 0x7311

#define STM32F769_PH4_FUNC_GPIO 0x7400
#define STM32F769_PH4_FUNC_I2C2_SCL 0x7405
#define STM32F769_PH4_FUNC_LCD_G5 0x740a
#define STM32F769_PH4_FUNC_OTG_HS_ULPI_NXT 0x740b
#define STM32F769_PH4_FUNC_EVENTOUT 0x7410
#define STM32F769_PH4_FUNC_ANALOG 0x7411

#define STM32F769_PH5_FUNC_GPIO 0x7500
#define STM32F769_PH5_FUNC_I2C2_SDA 0x7505
#define STM32F769_PH5_FUNC_SPI5_NSS 0x7506
#define STM32F769_PH5_FUNC_FMC_SDNWE 0x750d
#define STM32F769_PH5_FUNC_EVENTOUT 0x7510
#define STM32F769_PH5_FUNC_ANALOG 0x7511

#define STM32F769_PH6_FUNC_GPIO 0x7600
#define STM32F769_PH6_FUNC_I2C2_SMBA 0x7605
#define STM32F769_PH6_FUNC_SPI5_SCK 0x7606
#define STM32F769_PH6_FUNC_TIM12_CH1 0x760a
#define STM32F769_PH6_FUNC_ETH_MII_RXD2 0x760c
#define STM32F769_PH6_FUNC_FMC_SDNE1 0x760d
#define STM32F769_PH6_FUNC_DCMI_D8 0x760e
#define STM32F769_PH6_FUNC_EVENTOUT 0x7610
#define STM32F769_PH6_FUNC_ANALOG 0x7611

#define STM32F769_PH7_FUNC_GPIO 0x7700
#define STM32F769_PH7_FUNC_I2C3_SCL 0x7705
#define STM32F769_PH7_FUNC_SPI5_MISO 0x7706
#define STM32F769_PH7_FUNC_ETH_MII_RXD3 0x770c
#define STM32F769_PH7_FUNC_FMC_SDCKE1 0x770d
#define STM32F769_PH7_FUNC_DCMI_D9 0x770e
#define STM32F769_PH7_FUNC_EVENTOUT 0x7710
#define STM32F769_PH7_FUNC_ANALOG 0x7711

#define STM32F769_PH8_FUNC_GPIO 0x7800
#define STM32F769_PH8_FUNC_I2C3_SDA 0x7805
#define STM32F769_PH8_FUNC_FMC_D16 0x780d
#define STM32F769_PH8_FUNC_DCMI_HSYNC 0x780e
#define STM32F769_PH8_FUNC_LCD_R2 0x780f
#define STM32F769_PH8_FUNC_EVENTOUT 0x7810
#define STM32F769_PH8_FUNC_ANALOG 0x7811

