Tecnologic/u-boot-stm32/include/dt-bindings/pinctrl/stm32f769-pinfunc.h
#define STM32F769_PH9_FUNC_GPIO 0x7900
#define STM32F769_PH9_FUNC_I2C3_SMBA 0x7905
#define STM32F769_PH9_FUNC_TIM12_CH2 0x790a
#define STM32F769_PH9_FUNC_FMC_D17 0x790d
#define STM32F769_PH9_FUNC_DCMI_D0 0x790e
#define STM32F769_PH9_FUNC_LCD_R3 0x790f
#define STM32F769_PH9_FUNC_EVENTOUT 0x7910
#define STM32F769_PH9_FUNC_ANALOG 0x7911

#define STM32F769_PH10_FUNC_GPIO 0x7a00
#define STM32F769_PH10_FUNC_TIM5_CH1 0x7a03
#define STM32F769_PH10_FUNC_I2C4_SMBA 0x7a05
#define STM32F769_PH10_FUNC_FMC_D18 0x7a0d
#define STM32F769_PH10_FUNC_DCMI_D1 0x7a0e
#define STM32F769_PH10_FUNC_LCD_R4 0x7a0f
#define STM32F769_PH10_FUNC_EVENTOUT 0x7a10
#define STM32F769_PH10_FUNC_ANALOG 0x7a11

#define STM32F769_PH11_FUNC_GPIO 0x7b00
#define STM32F769_PH11_FUNC_TIM5_CH2 0x7b03
#define STM32F769_PH11_FUNC_I2C4_SCL 0x7b05
#define STM32F769_PH11_FUNC_FMC_D19 0x7b0d
#define STM32F769_PH11_FUNC_DCMI_D2 0x7b0e
#define STM32F769_PH11_FUNC_LCD_R5 0x7b0f
#define STM32F769_PH11_FUNC_EVENTOUT 0x7b10
#define STM32F769_PH11_FUNC_ANALOG 0x7b11

#define STM32F769_PH12_FUNC_GPIO 0x7c00
#define STM32F769_PH12_FUNC_TIM5_CH3 0x7c03
#define STM32F769_PH12_FUNC_I2C4_SDA 0x7c05
#define STM32F769_PH12_FUNC_FMC_D20 0x7c0d
#define STM32F769_PH12_FUNC_DCMI_D3 0x7c0e
#define STM32F769_PH12_FUNC_LCD_R6 0x7c0f
#define STM32F769_PH12_FUNC_EVENTOUT 0x7c10
#define STM32F769_PH12_FUNC_ANALOG 0x7c11

#define STM32F769_PH13_FUNC_GPIO 0x7d00
#define STM32F769_PH13_FUNC_TIM8_CH1N 0x7d04
#define STM32F769_PH13_FUNC_UART4_TX 0x7d09
#define STM32F769_PH13_FUNC_CAN1_TX 0x7d0a
#define STM32F769_PH13_FUNC_FMC_D21 0x7d0d
#define STM32F769_PH13_FUNC_LCD_G2 0x7d0f
#define STM32F769_PH13_FUNC_EVENTOUT 0x7d10
#define STM32F769_PH13_FUNC_ANALOG 0x7d11

#define STM32F769_PH14_FUNC_GPIO 0x7e00
#define STM32F769_PH14_FUNC_TIM8_CH2N 0x7e04
#define STM32F769_PH14_FUNC_UART4_RX 0x7e09
#define STM32F769_PH14_FUNC_CAN1_RX 0x7e0a
#define STM32F769_PH14_FUNC_FMC_D22 0x7e0d
#define STM32F769_PH14_FUNC_DCMI_D4 0x7e0e
#define STM32F769_PH14_FUNC_LCD_G3 0x7e0f
#define STM32F769_PH14_FUNC_EVENTOUT 0x7e10
#define STM32F769_PH14_FUNC_ANALOG 0x7e11

#define STM32F769_PH15_FUNC_GPIO 0x7f00
#define STM32F769_PH15_FUNC_TIM8_CH3N 0x7f04
#define STM32F769_PH15_FUNC_FMC_D23 0x7f0d
#define STM32F769_PH15_FUNC_DCMI_D11 0x7f0e
#define STM32F769_PH15_FUNC_LCD_G4 0x7f0f
#define STM32F769_PH15_FUNC_EVENTOUT 0x7f10
#define STM32F769_PH15_FUNC_ANALOG 0x7f11


#define STM32F769_PI0_FUNC_GPIO 0x8000
#define STM32F769_PI0_FUNC_TIM5_CH4 0x8003
#define STM32F769_PI0_FUNC_SPI2_NSS_I2S2_WS 0x8006
#define STM32F769_PI0_FUNC_FMC_D24 0x800d
#define STM32F769_PI0_FUNC_DCMI_D13 0x800e
#define STM32F769_PI0_FUNC_LCD_G5 0x800f
#define STM32F769_PI0_FUNC_EVENTOUT 0x8010
#define STM32F769_PI0_FUNC_ANALOG 0x8011

#define STM32F769_PI1_FUNC_GPIO 0x8100
#define STM32F769_PI1_FUNC_TIM8_BKIN2 0x8104
#define STM32F769_PI1_FUNC_SPI2_SCK_I2S2_CK 0x8106
#define STM32F769_PI1_FUNC_FMC_D25 0x810d
#define STM32F769_PI1_FUNC_DCMI_D8 0x810e
#define STM32F769_PI1_FUNC_LCD_G6 0x810f
#define STM32F769_PI1_FUNC_EVENTOUT 0x8110
#define STM32F769_PI1_FUNC_ANALOG 0x8111

#define STM32F769_PI2_FUNC_GPIO 0x8200
#define STM32F769_PI2_FUNC_TIM8_CH4 0x8204
#define STM32F769_PI2_FUNC_SPI2_MISO 0x8206
#define STM32F769_PI2_FUNC_FMC_D26 0x820d
#define STM32F769_PI2_FUNC_DCMI_D9 0x820e
#define STM32F769_PI2_FUNC_LCD_G7 0x820f
#define STM32F769_PI2_FUNC_EVENTOUT 0x8210
#define STM32F769_PI2_FUNC_ANALOG 0x8211

#define STM32F769_PI3_FUNC_GPIO 0x8300
#define STM32F769_PI3_FUNC_TIM8_ETR 0x8304
#define STM32F769_PI3_FUNC_SPI2_MOSI_I2S2_SD 0x8306
#define STM32F769_PI3_FUNC_FMC_D27 0x830d
#define STM32F769_PI3_FUNC_DCMI_D10 0x830e
#define STM32F769_PI3_FUNC_EVENTOUT 0x8310
#define STM32F769_PI3_FUNC_ANALOG 0x8311

#define STM32F769_PI4_FUNC_GPIO 0x8400
#define STM32F769_PI4_FUNC_TIM8_BKIN 0x8404
#define STM32F769_PI4_FUNC_SAI2_MCLK_A 0x840b
#define STM32F769_PI4_FUNC_FMC_NBL2 0x840d
#define STM32F769_PI4_FUNC_DCMI_D5 0x840e
#define STM32F769_PI4_FUNC_LCD_B4 0x840f
#define STM32F769_PI4_FUNC_EVENTOUT 0x8410
#define STM32F769_PI4_FUNC_ANALOG 0x8411

#define STM32F769_PI5_FUNC_GPIO 0x8500
#define STM32F769_PI5_FUNC_TIM8_CH1 0x8504
#define STM32F769_PI5_FUNC_SAI2_SCK_A 0x850b
#define STM32F769_PI5_FUNC_FMC_NBL3 0x850d
#define STM32F769_PI5_FUNC_DCMI_VSYNC 0x850e
#define STM32F769_PI5_FUNC_LCD_B5 0x850f
#define STM32F769_PI5_FUNC_EVENTOUT 0x8510
#define STM32F769_PI5_FUNC_ANALOG 0x8511

#define STM32F769_PI6_FUNC_GPIO 0x8600
#define STM32F769_PI6_FUNC_TIM8_CH2 0x8604
#define STM32F769_PI6_FUNC_SAI2_SD_A 0x860b
#define STM32F769_PI6_FUNC_FMC_D28 0x860d
#define STM32F769_PI6_FUNC_DCMI_D6 0x860e
#define STM32F769_PI6_FUNC_LCD_B6 0x860f
#define STM32F769_PI6_FUNC_EVENTOUT 0x8610
#define STM32F769_PI6_FUNC_ANALOG 0x8611

#define STM32F769_PI7_FUNC_GPIO 0x8700
#define STM32F769_PI7_FUNC_TIM8_CH3 0x8704
#define STM32F769_PI7_FUNC_SAI2_FS_A 0x870b
#define STM32F769_PI7_FUNC_FMC_D29 0x870d
#define STM32F769_PI7_FUNC_DCMI_D7 0x870e
#define STM32F769_PI7_FUNC_LCD_B7 0x870f
#define STM32F769_PI7_FUNC_EVENTOUT 0x8710
#define STM32F769_PI7_FUNC_ANALOG 0x8711

#define STM32F769_PI8_FUNC_GPIO 0x8800
#define STM32F769_PI8_FUNC_EVENTOUT 0x8810
#define STM32F769_PI8_FUNC_ANALOG 0x8811

#define STM32F769_PI9_FUNC_GPIO 0x8900
#define STM32F769_PI9_FUNC_UART4_RX 0x8909
#define STM32F769_PI9_FUNC_CAN1_RX 0x890a
#define STM32F769_PI9_FUNC_FMC_D30 0x890d
#define STM32F769_PI9_FUNC_LCD_VSYNC 0x890f
#define STM32F769_PI9_FUNC_EVENTOUT 0x8910
#define STM32F769_PI9_FUNC_ANALOG 0x8911

#define STM32F769_PI10_FUNC_GPIO 0x8a00
#define STM32F769_PI10_FUNC_ETH_MII_RX_ER 0x8a0c
#define STM32F769_PI10_FUNC_FMC_D31 0x8a0d
#define STM32F769_PI10_FUNC_LCD_HSYNC 0x8a0f
#define STM32F769_PI10_FUNC_EVENTOUT 0x8a10
#define STM32F769_PI10_FUNC_ANALOG 0x8a11

#define STM32F769_PI11_FUNC_GPIO 0x8b00
#define STM32F769_PI11_FUNC_LCD_G6 0x8b0a
#define STM32F769_PI11_FUNC_OTG_HS_ULPI_DIR 0x8b0b
#define STM32F769_PI11_FUNC_EVENTOUT 0x8b10
#define STM32F769_PI11_FUNC_ANALOG 0x8b11

#define STM32F769_PI12_FUNC_GPIO 0x8c00
#define STM32F769_PI12_FUNC_LCD_HSYNC 0x8c0f
#define STM32F769_PI12_FUNC_EVENTOUT 0x8c10
#define STM32F769_PI12_FUNC_ANALOG 0x8c11

#define STM32F769_PI13_FUNC_GPIO 0x8d00
#define STM32F769_PI13_FUNC_LCD_VSYNC 0x8d0f
#define STM32F769_PI13_FUNC_EVENTOUT 0x8d10
#define STM32F769_PI13_FUNC_ANALOG 0x8d11

#define STM32F769_PI14_FUNC_GPIO 0x8e00
#define STM32F769_PI14_FUNC_LCD_CLK 0x8e0f
#define STM32F769_PI14_FUNC_EVENTOUT 0x8e10
#define STM32F769_PI14_FUNC_ANALOG 0x8e11

#define STM32F769_PI15_FUNC_GPIO 0x8f00
#define STM32F769_PI15_FUNC_LCD_G2 0x8f0a
#define STM32F769_PI15_FUNC_LCD_R0 0x8f0f
#define STM32F769_PI15_FUNC_EVENTOUT 0x8f10
#define STM32F769_PI15_FUNC_ANALOG 0x8f11


