Tecnologic/u-boot-stm32/include/dt-bindings/pinctrl/stm32f769-pinfunc.h
#define STM32F769_PJ0_FUNC_GPIO 0x9000
#define STM32F769_PJ0_FUNC_LCD_R7 0x900a
#define STM32F769_PJ0_FUNC_LCD_R1 0x900f
#define STM32F769_PJ0_FUNC_EVENTOUT 0x9010
#define STM32F769_PJ0_FUNC_ANALOG 0x9011

#define STM32F769_PJ1_FUNC_GPIO 0x9100
#define STM32F769_PJ1_FUNC_LCD_R2 0x910f
#define STM32F769_PJ1_FUNC_EVENTOUT 0x9110
#define STM32F769_PJ1_FUNC_ANALOG 0x9111

#define STM32F769_PJ2_FUNC_GPIO 0x9200
#define STM32F769_PJ2_FUNC_DSI_TE 0x920e
#define STM32F769_PJ2_FUNC_LCD_R3 0x920f
#define STM32F769_PJ2_FUNC_EVENTOUT 0x9210
#define STM32F769_PJ2_FUNC_ANALOG 0x9211

#define STM32F769_PJ3_FUNC_GPIO 0x9300
#define STM32F769_PJ3_FUNC_LCD_R4 0x930f
#define STM32F769_PJ3_FUNC_EVENTOUT 0x9310
#define STM32F769_PJ3_FUNC_ANALOG 0x9311

#define STM32F769_PJ4_FUNC_GPIO 0x9400
#define STM32F769_PJ4_FUNC_LCD_R5 0x940f
#define STM32F769_PJ4_FUNC_EVENTOUT 0x9410
#define STM32F769_PJ4_FUNC_ANALOG 0x9411

#define STM32F769_PJ5_FUNC_GPIO 0x9500
#define STM32F769_PJ5_FUNC_LCD_R6 0x950f
#define STM32F769_PJ5_FUNC_EVENTOUT 0x9510
#define STM32F769_PJ5_FUNC_ANALOG 0x9511

#define STM32F769_PJ6_FUNC_GPIO 0x9600
#define STM32F769_PJ6_FUNC_LCD_R7 0x960f
#define STM32F769_PJ6_FUNC_EVENTOUT 0x9610
#define STM32F769_PJ6_FUNC_ANALOG 0x9611

#define STM32F769_PJ7_FUNC_GPIO 0x9700
#define STM32F769_PJ7_FUNC_LCD_G0 0x970f
#define STM32F769_PJ7_FUNC_EVENTOUT 0x9710
#define STM32F769_PJ7_FUNC_ANALOG 0x9711

#define STM32F769_PJ8_FUNC_GPIO 0x9800
#define STM32F769_PJ8_FUNC_LCD_G1 0x980f
#define STM32F769_PJ8_FUNC_EVENTOUT 0x9810
#define STM32F769_PJ8_FUNC_ANALOG 0x9811

#define STM32F769_PJ9_FUNC_GPIO 0x9900
#define STM32F769_PJ9_FUNC_LCD_G2 0x990f
#define STM32F769_PJ9_FUNC_EVENTOUT 0x9910
#define STM32F769_PJ9_FUNC_ANALOG 0x9911

#define STM32F769_PJ10_FUNC_GPIO 0x9a00
#define STM32F769_PJ10_FUNC_LCD_G3 0x9a0f
#define STM32F769_PJ10_FUNC_EVENTOUT 0x9a10
#define STM32F769_PJ10_FUNC_ANALOG 0x9a11

#define STM32F769_PJ11_FUNC_GPIO 0x9b00
#define STM32F769_PJ11_FUNC_LCD_G4 0x9b0f
#define STM32F769_PJ11_FUNC_EVENTOUT 0x9b10
#define STM32F769_PJ11_FUNC_ANALOG 0x9b11

#define STM32F769_PJ12_FUNC_GPIO 0x9c00
#define STM32F769_PJ12_FUNC_LCD_G3 0x9c0a
#define STM32F769_PJ12_FUNC_LCD_B0 0x9c0f
#define STM32F769_PJ12_FUNC_EVENTOUT 0x9c10
#define STM32F769_PJ12_FUNC_ANALOG 0x9c11

#define STM32F769_PJ13_FUNC_GPIO 0x9d00
#define STM32F769_PJ13_FUNC_LCD_G4 0x9c0a
#define STM32F769_PJ13_FUNC_LCD_B1 0x9d0f
#define STM32F769_PJ13_FUNC_EVENTOUT 0x9d10
#define STM32F769_PJ13_FUNC_ANALOG 0x9d11

#define STM32F769_PJ14_FUNC_GPIO 0x9e00
#define STM32F769_PJ14_FUNC_LCD_B2 0x9e0f
#define STM32F769_PJ14_FUNC_EVENTOUT 0x9e10
#define STM32F769_PJ14_FUNC_ANALOG 0x9e11

#define STM32F769_PJ15_FUNC_GPIO 0x9f00
#define STM32F769_PJ15_FUNC_LCD_B3 0x9f0f
#define STM32F769_PJ15_FUNC_EVENTOUT 0x9f10
#define STM32F769_PJ15_FUNC_ANALOG 0x9f11


#define STM32F769_PK0_FUNC_GPIO 0xa000
#define STM32F769_PK0_FUNC_LCD_G5 0xa00f
#define STM32F769_PK0_FUNC_EVENTOUT 0xa010
#define STM32F769_PK0_FUNC_ANALOG 0xa011

#define STM32F769_PK1_FUNC_GPIO 0xa100
#define STM32F769_PK1_FUNC_LCD_G6 0xa10f
#define STM32F769_PK1_FUNC_EVENTOUT 0xa110
#define STM32F769_PK1_FUNC_ANALOG 0xa111

#define STM32F769_PK2_FUNC_GPIO 0xa200
#define STM32F769_PK2_FUNC_LCD_G7 0xa20f
#define STM32F769_PK2_FUNC_EVENTOUT 0xa210
#define STM32F769_PK2_FUNC_ANALOG 0xa211

#define STM32F769_PK3_FUNC_GPIO 0xa300
#define STM32F769_PK3_FUNC_LCD_B4 0xa30f
#define STM32F769_PK3_FUNC_EVENTOUT 0xa310
#define STM32F769_PK3_FUNC_ANALOG 0xa311

#define STM32F769_PK4_FUNC_GPIO 0xa400
#define STM32F769_PK4_FUNC_LCD_B5 0xa40f
#define STM32F769_PK4_FUNC_EVENTOUT 0xa410
#define STM32F769_PK4_FUNC_ANALOG 0xa411

#define STM32F769_PK5_FUNC_GPIO 0xa500
#define STM32F769_PK5_FUNC_LCD_B6 0xa50f
#define STM32F769_PK5_FUNC_EVENTOUT 0xa510
#define STM32F769_PK5_FUNC_ANALOG 0xa511

#define STM32F769_PK6_FUNC_GPIO 0xa600
#define STM32F769_PK6_FUNC_LCD_B7 0xa60f
#define STM32F769_PK6_FUNC_EVENTOUT 0xa610
#define STM32F769_PK6_FUNC_ANALOG 0xa611

#define STM32F769_PK7_FUNC_GPIO 0xa700
#define STM32F769_PK7_FUNC_LCD_DE 0xa70f
#define STM32F769_PK7_FUNC_EVENTOUT 0xa710
#define STM32F769_PK7_FUNC_ANALOG 0xa711

#endif /* _DT_BINDINGS_STM32F769_PINFUNC_H */
